{
  "Как вывести вывод постранично (например, lscpu)?": "lscpu | more/ lscpu | less / lscpu | head -n 10",
  "Как вывести вывод первых 10 строк (например, lscpu)?": "lscpu | head -n 10",
  "Как очистить консоль вывод (команда или горячие клавиши)?": "clear / ctrl + l",
  "Что такое '|' и как его использовать?": "(pipe), которая используется для передачи вывода одной команды в качестве ввода для другой команды.",
  "Узнать свободное место на диске": "df -h",
  "Показать объем оперативной памяти": "free -h",
  "Показать имя текущего пользователя": "whoami",
  "Показать текущую папку": "pwd (print working directory - вывести текущий рабочий каталог)",
  "Что означает '/' в начале пути?": "Корневая папка",
  "Что означает ': ~$' ?": "Домашний папка текущего пользователя",
  "Что означает '$' ?": "Права доступа пользователя",
  "Что означает '#' ?": "Права доступа администратора (root), т.е. суперпользователя (superuser) (привилегированные права)",
  "Как быстро перейти в домашнюю директорию текущего пользователя?": "cd ~",
  "Как перейти в самую корневую папку?": "cd /",
  "Как перейти на уровень выше?": "cd ..",
  "С чего начинается абсолютный путь?": " '/' - Слеш",
  "Вывести содержимое текущей директории": "ls (List - список)",
  "Вывести содержимое текущей директории с подробностями": "ls -l (long)",
  "Вывести содержимое текущей директории включая и скрытые файлы": "ls -a (all)",
  "Вывести содержимое директории 'Downloads' отсортированные по размеру ": "ls -lhS Downloads/",
  "Вывести содержимое текущей директории отсортированные по изменениям с начала от самых новых к самым старым": "ls -ltr (long, time, reverse sorted by time)",
  "Вывести содержимое текущей директории по размеру от меньшего к большему": "ls -lSr (human, Sort, reverse sorted by size)",
  "Вывести содержимое текущей дирктории включая и скрытые файлы с подробностями": "ls -al (all long)",
  "Какую команду вести чтобы сменить директорию?": "cd (change directory - сменить директорию)",
  "Какую команду вести чтобы создать директорию?": "mkdir",
  "Какую команду вести чтобы удалить директорию (совсем содержимым и саму директорию)?": "rm -r",
  "Вывести информации о файловой систему включая доступное и использованное место": "df -h",
  "andrii@andrii-PC:~$ Что значить эта строка?": "'andrii' - это имя пользователя, 'andrii-PC' - это имя сервира,'~' - это домашняя директория пользователя",
  "Вывести сколько юзеровв системе": "uptime",
  "Вывести сколько времени включена система": "uptime",
  "Вывести текущее время системы": "uptime",
  "Вывести дату и время": "date",
  "Вывести операционную систему": "uname",
  "Вывести информацию о системе (дистрибутив и версия и т.д.)": "uname -a",
  "Вывесит информации о процессорах": "lscpu",
  "Что значит CPU(s): 3": "Количество ядер",
  "Что значить BogoMIPS: 3379.00": "(от 'Bogus Millions of Instructions Per Second') — это неофициальная единица измерения производительности процессора, которая используется в основном в операционной системе Linux. Значение BogoMIPS указывает на количество "бессмысленных" миллионов инструкций, которое процессор может выполнить за одну секунду, но это число не следует воспринимать как реальную производительность в стандартных вычислениях.",
  "Как переключится в текстовый интерфейс системы (и как возвращаться обратно?": "ctrl + alt + f3 (f4, f5, f6) / alt + f2",
  "Где находятся все команды системы? Как узнать?": "echo $PATH",
  "Как вывести все команды системы где содержаться слово 'time'?": "man -k time (man pages keywords - ключевые слова)",
  "Как Прервать процесс или исполнение команды?": "ctrl + c",
  "Как посмотреть описание команды?": "man <command name> example: man uptime (открывает описание команды в Manual page (or $ info uptime",
  "Как в Manual page найти все слова 'system' и как потом переключаться по этим словам?": "/ system (n - переходит в перед по найденному слову N - переход на предыдущее слово)",
  "Как вывести в консоль описание что делает команда например lscpu?": "whatis lscpu",
  "Как узнать где находится команда lscpu?": "whereis lscpu",
  "Что значит команда 'sudo'?": "sudo 'superuser do' Эта команда позволяет выполнить команды с правами супер пользователя (root) Это необходима для выполнения операции которые требуют повышенных привилегий таких как установка или удаление программ",
  "Что значить команда 'apt'?": "apt 'Advanced Packaging Tool' Это инструмент для управления пакетами в системах на базе Debian. Позволяет устанавливать, удалять и обновлять пакеты программного обеспечения",
  "Что означает 'install'?": "install - установить. Это команда apt которая указывает что нужно установить указанный пакет",
  "Что означает 'sudo apt install plocate'?": "sudo apt install plocate - установить программу plocate",
  "В чем разница между 'locate' и 'whereis'?": "locate - ищет все файлы в системе, whereis - ищет исполняемые файлы или документацию",
  "Как узнать где находятся исполняемая программа или команда?": "whereis <command>",
  "Как узнать какие программы установлены в системе?": "apt list --installed",
  "Как сделать ping на google?": "ping www.google.com",
  "Как отправить выполнение команды в фон например команда 'ping www.google.com'?": "ctrl+ z",
  "Как прервать выполнение команды в фоне?": "ctrl+ c",
  "Как узнать какие процессы запущены в системе?": "ps",
  "Как вернуть выполнение команды из фонового режима?": "fg (foreground - передний план)",
  "Как вывести все файлы и каталоги систему?": "sudo ls -la -R / (R - рекурсивно)",
}
