SELECT
  POWER(number1, number2) AS result
FROM
  decimals;

-- POWER - это математическая функция в PostgreSQL, 
-- которая возводит число в заданную степень.

-- Примеры использования:

-- SELECT POWER(2, 3); 
-- Результат: 8 Этот запрос возводит число 2 в степень 3, что равно 8.

-- SELECT POWER(5.5, 2); 
-- Результат: 30.25 Этот запрос возводит число 5.5 в квадрат, что равно 30.25.

-- SELECT POWER(10, 0.5); 
-- Результат: 3.16227766016838 Этот запрос извлекает квадратный корень из числа 10, что равно 3.16227766016838.